tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "shivammathur/php"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Ruby environment tool
brew "chruby"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU compiler collection
brew "gcc"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Apache HTTP server
brew "httpd", restart_service: true
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Open source relational database management system
brew "mysql", restart_service: true
# General-purpose scripting language
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Next-generation plugin manager for zsh
brew "zplug"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
cask "gulp"
